Revit 2027 API
BuiltInFailures.StairRampFailures.StairsGenericTransformFailure Property
 Cannot change base elevation of Stairs
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsGenericTransformFailure { get; }
Public Shared ReadOnly Property StairsGenericTransformFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsGenericTransformFailure {
	FailureDefinitionId^ get ();
}
static member StairsGenericTransformFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace